{
    "zh_cn":{
        "config":{
            "CET":"经济学数据分析工具箱",
            "name":"数据分析操作手册",
            "desc":"该网页旨在为人们提供一份数据分析的流程化操作。我们希望该功能可以帮助您通过一种简单但是专业的方式了解数据分析的基本步骤。从数据清洗开始，到数据分析，我们将提供处理数据的过程中最常用的功能。快开始使用吧！"
        },
        "getd":{
            "name":"数据预览",
            "desc":"你需要了解你的数据。不要急于直接进行数据分析，请先了解数据集中的变量。"
        },
        "dsummary":{
            "name":"单变量描述性统计",
            "desc":"单变量描述性统计输出某一变量的均值、标准差、最大值、最小值和四分位数。"
        },
        "xsummary":{
            "name":"多变量描述性统计",
            "desc":"多变量描述性统计是对数据表中多个变量分别进行描述性统计,并将结果显示在一张表中,方便对数据构建整体上的直观认识"
        },
        "xcorr":{
            "name":"相关系数矩阵",
            "desc":"相关系数矩阵提供了数据中不同变量两两之间的相关系数（皮尔逊相关系数），以及其显著性水平。",
            "url":"https://baike.baidu.com/item/%E7%9B%B8%E5%85%B3%E7%B3%BB%E6%95%B0/3109424?fr=aladdin"
        },
        "dimg_density":{
            "name":"概率密度图",
            "desc":"概率密度函数是一个描述随机变量的输出值在某个确定的取值点附近的可能性的函数，概率密度函数在定义域上的积分为1。",
            "use":"请选择某一变量,系统将提供其对应的概率密度图",
            "url":"https://baike.baidu.com/item/%E6%A6%82%E7%8E%87%E5%AF%86%E5%BA%A6%E5%87%BD%E6%95%B0/5021996"
        },
        "dimg_hist":{
            "name":"直方图",
            "desc":"直方图，又称质量分布图，一般用横轴表示数据的取值范围，纵轴表示在该取值范围下的分布概率，直方图的面积总和为1。",
            "use":"请选择某一变量,系统将提供其对应的直方图",
            "url":"https://baike.baidu.com/item/%E7%9B%B4%E6%96%B9%E5%9B%BE/1103834"
        },
        "dimg_line":{
            "name":"折线图",
            "desc":"折线图可以显示一个变量随另一个变量（通常是时间）的变化情况，，通常适用于描述变量的时间趋势。",
            "use":"请选择某两个变量,系统将提供其对应的折线图",
            "url":"https://baike.baidu.com/item/%E6%8A%98%E7%BA%BF%E5%9B%BE/10816540?fr=aladdin"
        },
        "dimg_regress":{
            "name":"散点图及拟合曲线",
            "desc":"散点图将每个观测值作为一个散点绘制在平面直角坐标系上，而拟合曲线则可以根据所选函数类型，对全部散点进行拟合。",
            "use":"请选择解释变量和被解释变量,系统将提供其对应的散点及拟合图",
            "url_sandian":"https://baike.baidu.com/item/%E6%95%A3%E7%82%B9%E5%9B%BE",
            "url_nihe":"https://baike.baidu.com/item/%E6%8B%9F%E5%90%88%E6%9B%B2%E7%BA%BF"
        },
        "dimg_density_type":{
            "name":"分类概率密度图",
            "desc":"分类概率密度图是按照一个分类变量将数据集划分为不同的子样本，并在一张图中对各子样本单独绘制概率密度图。",
            "use":"请选择分类变量和数值型变量，系统将提供其对应的分类密度图"
        },
        "dimg_bar_type":{
            "name":"柱状图",
            "desc":"柱状图是按照一个分类变量将数据集划分为不同的部分，将每部分的数值变量的均值绘制为柱状图，并提供95%置信区间。",
            "use":"请选择分类变量和数值型变量，系统将提供其对应的分类柱状图",
            "url":"https://baike.baidu.com/item/%E6%9F%B1%E5%BD%A2%E5%9B%BE?fromtitle=%E6%9F%B1%E7%8A%B6%E5%9B%BE&fromid=10963683"
        },
        "dimg_hetero_density":{
            "name":"异质性分析-核密度图",
            "desc":"异质性分析-核密度图是依据选定的数值型变量和临界点将数据集划分为不同的子样本，并在一张图中对各子样本单独绘制概率密度图。",
            "use":"请选择数值型变量并输入临界值，系统将提供其对应的异质性分析-核密度图"
        },
        "dimg_hetero_regress":{
            "name":"异质性分析-散点图及拟合曲线",
            "desc":"异质性分析-散点拟合图是依据选定的数值型变量和临界点将数据集划分为不同的子样本，并在一张图中对各子样本单独绘制散点图及拟合曲线。",
            "use":"请选择数值型变量并输入临界值，系统将提供其对应的异质性分析-散点拟合图"
        },
        "dimg_hetero_corr":{
            "name":"异质性分析-相关系数",
            "desc":"异质性分析-相关系数是依据选定的数值型变量和临界点将数据集划分为不同的子样本，在每个子样本中分别计算各变量的计算相关系数。",
            "use":"请选择数值型变量并输入临界值，系统将计算子样本中各变量的相关系数和其显著性"
        },
        "loss_test":{
            "name":"缺失值预览",
            "desc":"缺失值预览是显示所选变量为缺失值的样本，并返回缺失值总数和观测值总数。",
            "use":"请选择一个或多个变量，系统将展示相应变量为缺失值的样本"
        },
        "loss_delete":{
            "name":"缺失值删减",
            "desc":"如果一个观测值的某个变量存在缺失值，你可以删除掉这个观测值。（注：如非必要，请不要随意删除数据。）",
            "use":"请选择一个或多个变量，系统将删除相应变量为缺失值的样本并将展示删除后的新数据"
        },
        "var_filter":{
            "name":"观测值删减",
            "desc":"观测值删减是将所选变量列中符合所选条件的观测值进行删除，对于数值型数据，可根据范围进行限定，如删去年龄大于5且小于等于10的观测值。对于字符串型数据，可进行准确删除，如删去小区变量为“幸福里”的观测值，也可以进行模糊删除，如删去小区变量包含“幸福”字符串的观测值。",
            "use":"请选择一个或多个变量，系统将删除符合相应条件的观测值"
        },
        "regression":{
            "name":"回归分析",
            "desc":"确定两种或两种以上变量间相互依赖的定量关系的一种统计分析方法。",
            "url":"https://baike.baidu.com/item/%E5%9B%9E%E5%BD%92%E5%88%86%E6%9E%90/2625498?fr=aladdin"
        },
        "regression_table":{
            "name":"绘制回归表格",
            "desc":"该功能可以直接输出回归分析的表格，您需要选择在一个表格中包含多少次回归分析的结果，然后分别设定回归形式后输出。"
        }
    },
    "en_us":{
        "config":{
            "CET":"Computational economics data analysis toolbox"
        },
        "getd":{
            "name":"data preview",
            "desc":"data preview"
        },
        "dsummary":{
            "name":"Univariate descriptive statistics",
            "desc":"Univariate descriptive statistics is a descriptive statistics of a column in the data table, including the maximum, minimum, standard deviation, quartiles and other common statistical variables."
        },
        "xsummary":{
            "name":"Comprehensive Descriptive Statistics",
            "desc":"Comprehensive descriptive statistics is to perform a descriptive statistics on many columns in the data table, and display the results in a table, which is convenient to have an overall intuitive understanding of the data."
        },
        "xcorr":{
            "name":"Correlation Matrix",
            "desc":"A correlation matrix is simply a table which displays the correlation coefficients for different variables. The matrix depicts the correlation between all the possible pairs of values in a table. It is a powerful tool to summarize a large dataset and to identify and visualize patterns in the given data."
        },
        "dimg_density":{
            "name":"Probability Density Curve",
            "desc":"In probability theory, a probability density function (PDF), or density of a continuous random variable, is a function whose value at any given sample (or point) in the sample space (the set of possible values taken by the random variable) can be interpreted as providing a relative likelihood that the value of the random variable would be close to that sample. A density curve is a graph that shows PDF. The area under the curve is equal to 100 percent of all probabilities. As we usually use decimals in probabilities you can also say that the area is equal to 1.",
            "use":"Please select a column, the system will draw its corresponding probability density map"
        },
        "dimg_hist":{
            "name":"Histogram",
            "desc":"A histogram is a graphical representation that organizes a group of data points into user-specified ranges.",
            "use":"Please select a column, the system will draw its corresponding histogram map"
        },
        "dimg_line":{
            "name":"Line Chart",
            "desc":"A line chart or line plot or line graph or curve chart is a type of chart which displays information as a series of data points called 'markers' connected by straight line segments. It is a basic type of chart common in many fields. It is similar to a scatter plot except that the measurement points are ordered (typically by their x-axis value) and joined with straight line segments. A line chart is often used to visualize a trend in data over intervals of time - a time series - thus the line is often drawn chronologically. In these cases they are known as run charts.",
            "use":"Please select two columns, the system will draw its line chart"
        },
        "dimg_regress":{
            "name":"Scatter plot",
            "desc":"A scatter plot uses dots to represent values for two different numeric variables. The position of each dot on the horizontal and vertical axis indicates values for an individual data point. Scatter plots are used to observe relationships between variables.",
            "use":"Please select dependent variables and independent variables, the system will draw its scatter plot."
        },
        "dimg_density_type":{
            "name":"Categorical probability density plot",
            "desc":"A categorical probability density plot divides the data set into different parts according to a categorical variable, plots the probability density plot for each part separately and plots the results on a graph。",
            "use":"Please select the categorical and numerical variables, and the system will draw their corresponding categorical density maps"
        },
        "dimg_bar_type":{
            "name":"Categorical bar chart",
            "desc":"A categorical bar chart divides the data set into different parts according to a categorical variable, plots the mean of the numerical variable in each part as a bar chart, and uses the standard deviation as the error bar.",
            "use":"Please select the categorical and numerical variables, and the system will draw their corresponding categorical bar graphs"
        },
        "dimg_hetero_density":{
            "name":"Heterogeneity analysis-nuclear density map",
            "desc":"A categorical histogram divides the data set into different parts based on selected numerical variables and split points, and each part is plotted separately as a probability density graph and the results are plotted on a single graph.",
            "use":"Please select the numerical variable and enter the split value, the system will draw its corresponding heterogeneity analysis-kernel density map"
        },
        "dimg_hetero_regress":{
            "name":"Heterogeneity Analysis - Scatter Fit Plot",
            "desc":"A categorical histogram divides the data set into different parts based on selected numerical variables and split points, and each part is plotted separately as a scatter fit and the results are plotted on a single graph.",
            "use":"Please select the numerical variables and enter the split values, the system will draw its corresponding heterogeneity analysis - scatter fit graph"
        },
        "dimg_hetero_corr":{
            "name":"Heterogeneity analysis - correlation coefficient",
            "desc":"Categorical histograms are used to divide the data set into different parts based on selected numerical variables and split points, and correlation coefficients are calculated separately for each part.",
            "use":"Please select the numerical variables and enter the split values, the system will calculate the correlation coefficient for each part and its significance"
        },
        "loss_test":{
            "name":"Missing value preview",
            "desc":"The missing value preview shows the portion of the selection variable column that is missing and returns the total number of missing values and the total number of observed values.",
            "use":"Please select one or more variables and the system will display the corresponding variables as missing values"
        },
        "loss_delete":{
            "name":"Missing values - deleting",
            "desc":"Missing value deletion returns a new data set by deleting the missing value in the selected variable column of the original data.",
            "use":"Please select one or more variables and the system will delete the corresponding variables as missing values and display the new data"
        },
        "var_filter":{
            "name":"Observed values - deleting",
            "desc":"Observation value deletion is to delete the observation values that meet the selected conditions in the selected variable column. For numerical data, it can be limited according to the range, such as deleting the observation values whose age is greater than 5 and less than or equal to 10. For string data, accurate deletion can be carried out, such as deleting the observation value of the small variable as \"happiness\", can also be blurred deletion, such as deleting the observation value of the small variable containing \"happiness\" string. ",
            "use":"Please select one or more variables and the system will delete the observed values that meet the corresponding conditions"
        }
    }
} 

