{
    "zh_cn":{
        "config":{
            "CET":"计算经济学数据分析工具箱"
        },
        "getd":{
            "name":"数据预览",
            "desc":"查看所有数据"
        },
        "dsummary":{
            "name":"单变量描述性统计",
            "desc":"单变量描述性统计是对数据表中某一列进行一个描述性的统计,具体包括最大值、最小值、标准差、四分位数等常见的统计变量"
        },
        "xsummary":{
            "name":"综合描述性统计",
            "desc":"综合描述性统计是对数据表中很多列分别进行一个描述性的统计,并将结果显示在一张表中,方便对数据有一个整体上的直观认识"
        },
        "xcorr":{
            "name":"相关系数矩阵",
            "desc":"相关矩阵是一个简单的表格,显示不同变量的相关系数。该矩阵描述了表中所有可能的值对之间的相关性和显著性。它是一种强大的工具,可以汇总大型数据集,并识别和可视化给定数据中的模式。"
        },
        "dimg_density":{
            "name":"概率密度图",
            "desc":"概率密度指事件随机发生的机率。概率密度等于一段区间(事件的取值范围)的概率除以该段区间的长度。由概率密度构成的图叫做概率密度图。",
            "use":"请选择一列,系统将画出其对应的概率密度图"
        },
        "dimg_hist":{
            "name":"直方图",
            "desc":"直方图，又称质量分布图，是一种统计报告图，由一系列高度不等的纵向条纹或线段表示数据分布的情况。 一般用横轴表示数据类型，纵轴表示分布情况。",
            "use":"请选择一列,系统将画出其对应的直方图"
        },
        "dimg_line":{
            "name":"折线图",
            "desc":"折线图是排列在工作表的列或行中的数据可以绘制到折线图中。折线图可以显示随时间（根据常用比例设置）而变化的连续数据，因此非常适用于显示在相等时间间隔下数据的趋势。",
            "use":"请选择两列变量,系统将画出其对应的折线图"
        },
        "dimg_regress":{
            "name":"散点拟合图",
            "desc":"散点图是指在回归分析中，数据点在直角坐标系平面上的分布图，散点图表示因变量随自变量而变化的大致趋势，据此可以选择合适的函数对数据点进行拟合。",
            "use":"请选择解释变量和被解释变量,系统将画出其对应的拟合图"
        },
        "dimg_density_type":{
            "name":"分类概率密度图",
            "desc":"分类概率密度图是按照一个分类变量将数据集划分为不同的部分，每部分单独绘制概率密度图并将结果绘制在一张图表上。",
            "use":"请选择分类变量和数值变量，系统将画出其对应的分类密度图"
        },
        "dimg_bar_type":{
            "name":"分类柱状图",
            "desc":"分类柱状图是按照一个分类变量将数据集划分为不同的部分，将每部分的数值变量的均值绘制为柱状图，并使用标准差作为错误栏。",
            "use":"请选择分类变量和数值变量，系统将画出其对应的分类柱状图"
        },
        "dimg_hetero_density":{
            "name":"异质性分析-核密度图",
            "desc":"分类柱状图是依据选定的数值变量和分割点将数据集划分为不同的部分，每部分单独绘制概率密度图并将结果绘制在一张图表上。",
            "use":"请选择数值变量并输入分割值，系统将画出其对应的异质性分析-核密度图"
        },
        "dimg_hetero_regress":{
            "name":"异质性分析-散点拟合图",
            "desc":"分类柱状图是依据选定的数值变量和分割点将数据集划分为不同的部分，每部分单独绘制散点拟合图并将结果绘制在一张图表上。",
            "use":"请选择数值变量并输入分割值，系统将画出其对应的异质性分析-散点拟合图"
        },
        "dimg_hetero_corr":{
            "name":"异质性分析-相关系数",
            "desc":"分类柱状图是依据选定的数值变量和分割点将数据集划分为不同的部分，每部分单独计算相关系数。",
            "use":"请选择数值变量并输入分割值，系统将计算每部分的相关系数和其显著性"
        },
        "loss_test":{
            "name":"缺失值预览",
            "desc":"缺失值预览是显示选择变量列中为缺失值的部分，并返回缺失值总数和观测值总数。",
            "use":"请选择一个或多个变量，系统将展示相应变量列为缺失值的部分"
        },
        "loss_delete":{
            "name":"缺失值删减",
            "desc":"缺失值删减是将原数据中所选变量列中为缺失值的部分删除，返回一个新的数据集。",
            "use":"请选择一个或多个变量，系统将删除相应变量列为缺失值的部分并将新数据展示"
        },
        "var_filter":{
            "name":"观测值删减",
            "desc":"观测值删减是将所选变量列中符合所选条件的观测值进行删除，对于数值型数据，可根据范围进行限定，如删去年龄大于5且小于等于10的观测值。对于字符串型数据，可进行准确删除，如删去小区变量为“幸福里”的观测值，也可以进行模糊删除，如删去小区变量包含“幸福”字符串的观测值。",
            "use":"请选择一个或多个变量，系统将删除符合相应条件的观测值"
        }
    },
    "en_us":{
        "config":{
            "CET":"Computational economics data analysis toolbox"
        },
        "getd":{
            "name":"data preview",
            "desc":"data preview"
        },
        "dsummary":{
            "name":"Univariate descriptive statistics",
            "desc":"Univariate descriptive statistics is a descriptive statistics of a column in the data table, including the maximum, minimum, standard deviation, quartiles and other common statistical variables."
        },
        "xsummary":{
            "name":"Comprehensive Descriptive Statistics",
            "desc":"Comprehensive descriptive statistics is to perform a descriptive statistics on many columns in the data table, and display the results in a table, which is convenient to have an overall intuitive understanding of the data."
        },
        "xcorr":{
            "name":"Correlation Matrix",
            "desc":"A correlation matrix is simply a table which displays the correlation coefficients for different variables. The matrix depicts the correlation between all the possible pairs of values in a table. It is a powerful tool to summarize a large dataset and to identify and visualize patterns in the given data."
        },
        "dimg_density":{
            "name":"Probability Density Curve",
            "desc":"In probability theory, a probability density function (PDF), or density of a continuous random variable, is a function whose value at any given sample (or point) in the sample space (the set of possible values taken by the random variable) can be interpreted as providing a relative likelihood that the value of the random variable would be close to that sample. A density curve is a graph that shows PDF. The area under the curve is equal to 100 percent of all probabilities. As we usually use decimals in probabilities you can also say that the area is equal to 1.",
            "use":"Please select a column, the system will draw its corresponding probability density map"
        },
        "dimg_hist":{
            "name":"Histogram",
            "desc":"A histogram is a graphical representation that organizes a group of data points into user-specified ranges.",
            "use":"Please select a column, the system will draw its corresponding histogram map"
        },
        "dimg_line":{
            "name":"Line Chart",
            "desc":"A line chart or line plot or line graph or curve chart is a type of chart which displays information as a series of data points called 'markers' connected by straight line segments. It is a basic type of chart common in many fields. It is similar to a scatter plot except that the measurement points are ordered (typically by their x-axis value) and joined with straight line segments. A line chart is often used to visualize a trend in data over intervals of time - a time series - thus the line is often drawn chronologically. In these cases they are known as run charts.",
            "use":"Please select two columns, the system will draw its line chart"
        },
        "dimg_regress":{
            "name":"Scatter plot",
            "desc":"A scatter plot uses dots to represent values for two different numeric variables. The position of each dot on the horizontal and vertical axis indicates values for an individual data point. Scatter plots are used to observe relationships between variables.",
            "use":"Please select dependent variables and independent variables, the system will draw its scatter plot."
        },
        "dimg_density_type":{
            "name":"Categorical probability density plot",
            "desc":"A categorical probability density plot divides the data set into different parts according to a categorical variable, plots the probability density plot for each part separately and plots the results on a graph。",
            "use":"Please select the categorical and numerical variables, and the system will draw their corresponding categorical density maps"
        },
        "dimg_bar_type":{
            "name":"Categorical bar chart",
            "desc":"A categorical bar chart divides the data set into different parts according to a categorical variable, plots the mean of the numerical variable in each part as a bar chart, and uses the standard deviation as the error bar.",
            "use":"Please select the categorical and numerical variables, and the system will draw their corresponding categorical bar graphs"
        },
        "dimg_hetero_density":{
            "name":"Heterogeneity analysis-nuclear density map",
            "desc":"A categorical histogram divides the data set into different parts based on selected numerical variables and split points, and each part is plotted separately as a probability density graph and the results are plotted on a single graph.",
            "use":"Please select the numerical variable and enter the split value, the system will draw its corresponding heterogeneity analysis-kernel density map"
        },
        "dimg_hetero_regress":{
            "name":"Heterogeneity Analysis - Scatter Fit Plot",
            "desc":"A categorical histogram divides the data set into different parts based on selected numerical variables and split points, and each part is plotted separately as a scatter fit and the results are plotted on a single graph.",
            "use":"Please select the numerical variables and enter the split values, the system will draw its corresponding heterogeneity analysis - scatter fit graph"
        },
        "dimg_hetero_corr":{
            "name":"Heterogeneity analysis - correlation coefficient",
            "desc":"Categorical histograms are used to divide the data set into different parts based on selected numerical variables and split points, and correlation coefficients are calculated separately for each part.",
            "use":"Please select the numerical variables and enter the split values, the system will calculate the correlation coefficient for each part and its significance"
        },
        "loss_test":{
            "name":"Missing value preview",
            "desc":"The missing value preview shows the portion of the selection variable column that is missing and returns the total number of missing values and the total number of observed values.",
            "use":"Please select one or more variables and the system will display the corresponding variables as missing values"
        },
        "loss_delete":{
            "name":"Missing values - deleting",
            "desc":"Missing value deletion returns a new data set by deleting the missing value in the selected variable column of the original data.",
            "use":"Please select one or more variables and the system will delete the corresponding variables as missing values and display the new data"
        },
        "var_filter":{
            "name":"Observed values - deleting",
            "desc":"Observation value deletion is to delete the observation values that meet the selected conditions in the selected variable column. For numerical data, it can be limited according to the range, such as deleting the observation values whose age is greater than 5 and less than or equal to 10. For string data, accurate deletion can be carried out, such as deleting the observation value of the small variable as \"happiness\", can also be blurred deletion, such as deleting the observation value of the small variable containing \"happiness\" string. ",
            "use":"Please select one or more variables and the system will delete the observed values that meet the corresponding conditions"
        }
    }
}